/*
*********************************************************************************
* Copyright (c) 2005,浙江大学嵌入式系统研究开发中心
* All rights reserved.
*
* 文件名称：crg.c
* 摘    要：包含CRG模块的驱动程序
*
* 当前版本：1.0
* 作    者：姜旭锋
* 完成日期：2005年2月20日
*********************************************************************************
*/
#ifndef _HCS12_CRG_C_
#define _HCS12_CRG_C_

#include "os_cpu.h"
#include "io_map.h"
#include "crg.h"
/*
*********************************************************************************
* 函数名：OSTickStart
* 说  明：启动系统时钟滴答 
*********************************************************************************
*/


void OSTickStart(void) {
  RTICTL = CRG_SCALE_1+CRG_PRESCALERATE_2E14; /*  CRG_SCALE_16 set RTI prescaler */ 
  CRGINT = 0x80; /* enable RTI interrupts */ 
}

/*
*********************************************************************************
* 函数名：PLLInit
* 说  明：初始化PLL模块 
*********************************************************************************
*/
void PLLInit(void){
  SYNR  = 3;

  REFDV = 7;

  while(!CRGFLG_LOCK);

  CLKSEL_PLLSEL=1;
}





#endif